<template>
  <div class="intros max-w-[600px]">
    從平面/UI設計師起家，經歷前端設計師，而後成功轉職為前端工程師。熟悉Photoshop,
    Illustrator，此經驗為我在擔任前端設計師/工程師時期的工作期間，省去了這些軟體的學習成本與與時間，並且可以流暢的使用Figma，甚至能夠注意到更多適合網頁使用的圖像設計細節(e.g.
    SVG結構與SVG動畫..)。當我在專案中擔任的角色是設計師時，我能夠以利於前端工程師開發為出發點去設計UI，同時當我在專案中擔任的角色是工程師時，我更能夠理解設計師的想法，另從前端開發的實作中，做些修正去彌補設計上的不足，甚至當需是做一些動態/動畫的呈現時，和設計師之間的合作更能省去不少的溝通成本。
    開始踏入前端開發領域後，學習就從來沒有停止過。最初的我，任職前端設計/開發於數位廣告公司，此一時期累積了豐富的響應式網頁(RWD)切版經驗，熟悉Bootstrap,
    懂得使用TweenMax,
    Scrollmagic等框架與插件，去達到視覺效果的要求。也是在這一時期，因為做了很多活動式網站，學會了基本的jQuery/JS，能夠完成表單檢查以及與後端API溝通的工作。然而漸漸地，這些並不能滿足我，於是我辭去廣告公司的職務，開始自己學習前端開發框架，並開啟了人生第一段Freelancing時期。
    使用前端開發框架來開發網站，意味著我的技能與知識又能夠更上一層樓了。不常不短的接案人生裡，和工作夥伴們完成一個又一個的Vue/Nuxt專案(或是義大利麵專案)以及電商網站/Shopify電商網站，完全地理解並且做到了前後端分離、以資料為基礎渲染出網頁的開發模式。與以前相比，是以完全不一樣的角度來看待網頁開發了，除了視覺呈現以外也開始關注於網站效能的表現。然而在這一時期的後期，我開始關注了WEB
    3D視覺，對 Three.js 產生了莫大的興趣。自行學習 Three.js
    一陣子後，決定應徵3D相關公司的前端工程師職位，於是又開啟了下一段不可思議的旅程。
    在這間公司下工作的期間內，除了更精進前端框架開發的技能以外，也接觸了e2e Testing的撰寫，了解如何將 3D
    物件運行於網頁上，並且揉合 API 建立好用、方便的使用者介面。又因當時正值 Metaverse 熱潮，我也接觸了 Web3.0
    相關的前端開發，具有與串接 Metamask , Ether contract 以及對於加密貨幣(主要為乙太)、NFT
    交易相關的前端開發經驗。在這間公司獲得了相較於以往更更不一樣的網頁開發思維，更像是在做網頁版的應用軟體(3D服裝設計整合軟體)，於此期間內累積了大量API
    溝通與串接的開發經驗。到這為止就完成了擁有網頁開發的甲方(SaaS)/乙方雙重開發經驗的里程碑了。
    然而前端開發旅程尚未結束，我將會繼續朝 React.js 前進，期待未來能夠參與有趣的專案。
  </div>
</template>
